/************************************************************************************************************/
/****************************************.INTERFACE.HORIZONTAL.MOVEMENT.*************************************/
/************************************************************************************************************/
/************************Данный интерфейс реализут горизонтальное перемещение обьекта.***********************/
/************************************************************************************************************/
public interface IHorizontalMovement
{
    /// <summary>
    /// Ссылка на скрипт отвечающий за горизонтальное перемещение.
    /// </summary>
    MBHorizontalMovement HorizontalMovement { get; }
}
