/************************************************************************************************************/
/*********************************************.IIOBuffer.****************************************************/
/************************************************************************************************************/
/****Классы реализующие данный интерфейс являются буферами(прослойоками) между КЕШЕМИ в которых хранятся*****/
/****************временые данные(свойсва, характеристики, события...) обьекта и иговой логикой.**************/ 
/***********************Сдесь описываются методы "Ввода" и "Вывода" информации.******************************/
/************************************************************************************************************/
/// <summary>
/// 
/// </summary>
/// <typeparam name="T">Интерфейс обьектов которые реализуют Ввод, Ввывод данных из КЕШЕЙ.</typeparam>
/// <typeparam name="R">Тип кеша или список кешей который обрабатывает данный Буфер.</typeparam>
public interface IIOBuffer<T, R>
{
    /// <summary>
    /// Ввод данных.
    /// </summary>
    /// <param name="pUnitDataBuffer">Способ обработки данных.</param>
    /// <param name="pInformation">Дополнительная информация для обработки данных.</param>
    void Input(T pUnitDataBuffer, string[] pInformation = null);

    /// <summary>
    /// Вывод данных.
    /// </summary>
    /// <param name="pName">Наменование кеша.</param>
    /// <returns>Возвращает кеш, с данными.</returns>
    R Output(string pName = null);
}

