/************************************************************************************************************/
/*********************************************.IIOBuffer.****************************************************/
/************************************************************************************************************/
/****Классы реализующие данный интерфейс являются буферами(прослойоками) между КЕШЕМИ в которых хранятся*****/
/****************временые данные(свойсва, характеристики, события...) обьекта и иговой логикой.**************/ 
/***********************Сдесь описываются методы "Ввода" и "Вывода" информации,******************************/
/************************************************************************************************************/
/// <summary>
/// 
/// </summary>
/// <typeparam name="T">Тип обьекта в котором вызывается метод.</typeparam>
/// <typeparam name="R">Тип кеша который использует данный буфер.</typeparam>
public interface IIOBuffer<T, R>
{
    /// <summary>
    /// Ввод данных.
    /// </summary>
    /// <param name="pUnitDataBuffer">Способ обработки данных.</param>
    /// <param name="pInformation">Дополнительная информация для обработки данных.</param>
    void Input(T pUnitDataBuffer, string[] pInformation = null);

    /// <summary>
    /// Вывод данных.
    /// </summary>
    /// <param name="pName">Наменование кеша.</param>
    /// <returns>Возвращает кеш, с данными.</returns>
    R Output(string pName);
}

